app/views/students/show.html.erb

SELECT "student_classes".* FROM "student_classes" WHERE "student_classes"."student_id" = ?  [["student_id", 1]]
---
    <ul>
    <% @student.student_classes.each do |student_class| %>