app/controllers/school_classes_controller.rb

INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Coding"], ["room_number", 20], ["created_at", "2021-01-14 19:23:14.866725"], ["updated_at", "2021-01-14 19:23:14.866725"]]
---
  def create
    new_school_class = SchoolClass.create(strong_params(:title, :room_number))

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "school_classes" SET "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["room_number", 3], ["updated_at", "2021-01-14 19:26:17.992411"], ["id", 1]]
---
  def update
    school_class = SchoolClass.find(params[:id])
    school_class.update(strong_params(:title, :room_number))