app/controllers/students_controller.rb

  def create
    @student = Student.create(strong_params)
---
INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Lauren"], ["last_name", "Gifford"], ["created_at", "2021-01-13 20:10:44.574081"], ["updated_at", "2021-01-13 20:10:44.574081"]]

  def update
    @student = Student.find(params[:id])
    @student.update(strong_params)
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "students" SET "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["last_name", "Lee"], ["updated_at", "2021-01-13 20:11:01.740539"], ["id", 3]]

  def destroy
    @student = Student.find(params[:id])
    @student.destroy
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
DELETE FROM "students" WHERE "students"."id" = ?  [["id", 4]]