app/controllers/student_classes_controller.rb

SELECT "student_classes".* FROM "student_classes"
---
    def index
        @student_classes = StudentClass.all

SELECT  "student_classes".* FROM "student_classes" WHERE "student_classes"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
    def show
        @student_class = StudentClass.find(params[:id])

INSERT INTO "student_classes" ("student_id", "school_class_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["student_id", 1], ["school_class_id", 2], ["created_at", "2021-01-14 21:12:12.453383"], ["updated_at", "2021-01-14 21:12:12.453383"]]
UPDATE "student_classes" SET "current" = ?, "updated_at" = ? WHERE "student_classes"."id" = ?  [["current", "t"], ["updated_at", "2021-01-14 21:12:12.462402"], ["id", 1]]
---
    def create
        new_student_class = StudentClass.create(student_class_params(:student_id, :school_class_id))
        new_student_class.update(current: true)