app/views/student_classes/new.html.erb


    <%= f.collection_select :student_id, Student.all, :id, :to_s %>
    <%= f.label :school_class_id, "School Class" %>
    <%= f.collection_select :school_class_id, SchoolClass.all, :id, :title %>
---
SELECT "students".* FROM "students"
SELECT "school_classes".* FROM "school_classes"